OpenFOAM/elliot-7/Dissertation/H/Parameterised/ConstSize/h5/GenCyclicHh5/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "variables"

convertToMeters 0.1;

vertices
(
    ($xmin $ymin $zmin) // 1
    ($h2 $ymin $zmin)
    ($h2 $ymax $zmin)
    ($xmin $ymax $zmin)
    ($xmin $ymin $h3)
    ($h2 $ymin $h3)
    ($h2 $ymax $h3)
    ($xmin $ymax $h3)
    ($xmin $ymin $cz) // 2
    ($h2 $ymin $cz)
    ($h2 $ymax $cz)
    ($xmin $ymax $cz)
    ($cx $ymin $h3) // 3
    ($cx $ymax $h3) 
    ($cx $ymin $cz)
    ($cx $ymax $cz) 
    ($lx $ymin $h3) // 4
    ($lx $ymax $h3)
    ($lx $ymin $cz)
    ($lx $ymax $cz) 
    ($cx $ymin $zmin) // 5
    ($cx $ymax $zmin)
    ($lx $ymin $zmin)
    ($lx $ymax $zmin) 
    ($xmin $ymin $lz) // 6
    ($xmin $ymax $lz)
    ($h2 $ymin $lz)
    ($h2 $ymax $lz)
    ($cx $ymin $lz) // 7
    ($cx $ymax $lz)
    ($lx $ymin $lz)
    ($lx $ymax $lz)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($x1cells $ycells $z1cells) simpleGrading (1 1 1)
    hex (4 5 6 7 8 9 10 11) ($x1cells $ycells $z2cells) simpleGrading (1 1 1)
    hex (5 12 13 6 9 14 15 10) ($x2cells $ycells $z2cells) simpleGrading (1 1 1)
    hex (12 16 17 13 14 18 19 15) ($x3cells $ycells $z2cells) simpleGrading (1 1 1)
    hex (20 22 23 21 12 16 17 13) ($x3cells $ycells $z1cells) simpleGrading (1 1 1)
    hex (8 9 10 11 24 26 27 25) ($x1cells $ycells $z1cells) simpleGrading (1 1 1)
    hex (14 18 19 15 28 30 31 29) ($x3cells $ycells $z1cells) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet1
    {
        type cyclic;
	neighbourPatch outlet1;
        faces
        (
            (0 1 2 3)
        );
    }
    inlet2
    {
        type cyclic;
	neighbourPatch outlet2;
	faces
        (
            (21 23 22 20)
        );
    }

    outlet1
    {
        type cyclic;
	neighbourPatch inlet1;
	faces
        (
            (25 27 26 24)
        );
    }

    outlet2
    {
        type cyclic;
	neighbourPatch inlet2;
	faces
        (
            (29 31 30 28)
        );
    }

    fixedWalls
    {
        type wall;
        faces
        (
	    (2 3 7 6) // 1
	    (0 1 4 5)
	    (3 0 4 7)
	    (2 1 5 6)
	    (7 6 10 11) // 2
	    (4 5 9 8)
	    (7 4 8 11)
	    (6 13 15 10) // 3
	    (5 12 14 9) 
	    (5 6 12 13)
	    (10 15 14 9)
	    (13 17 19 15) // 4
	    (17 16 18 19)
	    (12 16 18 14)
	    (21 23 17 13) // 5
	    (20 22 16 12)
	    (13 12 20 21)
	    (23 22 16 17)
	    (11 10 27 25) // 6
	    (8 9 26 24)
	    (11 25 24 8)
	    (10 9 26 27)
	    (15 19 31 29) // 7
	    (14 18 30 28)
	    (15 14 28 29)
	    (19 18 30 31)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
